import React from 'react';
import apps from '../images/apps.jpg';
import '../styles/Fourth.css';

function Fourth({ endPresentation }) {
  return (
    <div className='fourth-div'>
      <h1 className='animate__animated animate__backInDown'>מאמר תקשורתי: אופי פעילותם של אנשי התקשורת בישראל בעידן הרשתות החברתיות</h1>
      <div className='animate__animated animate__backInRight'>
        <img src={apps}/>
      </div>
      <p className='animate__animated animate__backInLeft'>
      כבר זמן רב שהרשתות החברתיות משמשות כמדיום החדש להעברת מסרים תקשורתיים, לעומת המדיום המסורתי,
      שהוא החדשות ועיתונים. לעומת המדיום הישן, הרשתות החברתיות מאפשרות לכל אחד להביע את עמדתו ללא מגבלות
      הצנזורה או "שומר הסף". בעקבות כך, ידוענים רבים מנצלים את הבמה שמעניקה להם הרשתות החברתיות בכדי למשוך
      אחריהם קהל רב שיתמוך במסע האקטיביזם החברתי של אותם ידוענים במטרה לקדם מחדל חברתי כזה או אחר.
      בדיוק כמו מארק רפאלו, האחיות חדיד ועוד ידוענים נוספים, ההשפעה של תגובותיהם למאבק יכולה לעצב בצורה שונה
      את התדמית של ישראל בעולם.
      </p>
      <br/>
      <p className='animate__animated animate__backInLeft'>
      לסיכום, תגובות ידוענים למבצע שומר החומות ובכללי להתנהלות ישראל בשטחים חשובות בכדי להבין את מצב התדמית
      של ישראל בעולם, במיוחד בעידן המודרני, כאשר הרשתות החברתיות מספקות במה לידוענים ואנשי תקשורת להביע את
      עמדתם ללא הצנזורה שמגבילה אותם בפלטפורמה כמו עיתונים/חדשות. נושא זה מלמד הרבה על תרבות הפייק-ניוז,
      מיסאינפורמציה, חופש הביטוי ועוד, ומקומה של הרשת החברתית בתקשורת.
      </p>
      <button className='btn' onClick={endPresentation}>שקופית הבאה</button>
    </div>
  );
}

export default Fourth;